# BuiltInFailures.ForeignFileFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ForeignFileFailures Class
BuiltInFailures Class Members See Also
---
Failures about files saved by applications that were not developed or licensed by Autodesk.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ForeignFileFailures
```

Visual Basic
---
```text
Public NotInheritable Class ForeignFileFailures
```

Visual C++
---
```text
public ref class ForeignFileFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ForeignFileFailures
# See Also
BuiltInFailures..::..ForeignFileFailures Members
Autodesk.Revit.DB Namespace